function addressKindChange(e) {
  var seoul = ["서울경부", "센트럴시티", "동서울", "상봉"];
  var incheon = ["인천", "성남", "수원", "인천공항T1", "인천공항T2", "안산", "안성중대", "이천", "용인", "고양백석", "고양화정", "광명(KTX역)", 
  "광명(철산역)", "구리", "부천", "서수원", "신갈시외", "신갈영덕", "시흥(시화)", "안성", "안성공도", "안성대림", "안성풍림", "안성한경", 
  "안성회관", "안중", "안중오거리", "여주", "여주대", "오산", "용인기흥역", "용인신갈", "용인유림", "의정부", "이천(마장택지구)", "이천부발(신하리)", 
  "죽전", "평택", "평택대", "평택용이"];
  var gangwon = ["원주고속", "속초고속", "강릉고속", "동해", "삼척", "양양", "원주기업", "원주문막", "원주혁신", "춘천", "횡성(휴)상행", "횡성(휴)하행"];
  var daejeon = ["대전복합", "천안고속", "서산", "유성고속", "세종청사", "당진", "공주", "대전청사(샘머리)", "세종터미널", "고대조치원", 
  "금산", "내포", "논산", "당진기지시", "대전도룡", "덕산스파", "배방정류소", "선문대", "세종국무조정실", "세종시청", "세종연구단지", "안면도", 
  "아산둔포", "아산서부(호서대)", "아산온양", "아산탕정사무소", "아산테크노밸리", "연무대", "예산", "인삼랜드(휴)상행", "인삼랜드(휴)하행", "정산", 
  "정안(휴)상행", "정안(휴)하행", "조치원", "창기리", "천안공단", "천안아산역", "청양", "탕정삼성", "태안", "홍대조치원", "홍성"];
  var chungbug = ["청주(센트럴)", "충주", "청주고속터미널", "북청주(청주대)", "교통대", "서충주", "제천", "제천하소", "청주공항", 
  "청주북부터미널", "황간"];
  var gwangju = ["광주(유스퀘어)", "순천", "목포", "여수", "강진", "고흥", "광양", "광주비아", "구례", "남악", "나주", "나주혁신도시", 
  "녹동", "능주", "담양", "동광양", "문장", "무안", "벌교", "보성", "섬진강(휴)상행", "섬진강(휴)하행", "순천신대지구", "순천신대지구CGV", "영광", 
  "영산포", "영암", "여천", "옥과", "완도", "원동", "임자대광", "임자진리", "장성", "고흥", "진도", "지도", "함평", "해남", "해제", "화순"];
  var jeonbuk = ["덕과", "순창", "애통리", "익산", "익산팔봉", "자치인재원", "전북혁신", "전주호남제일문", "정읍", "태인", "흥덕"];
  var busan = ["김해장유", "내서", "마산고속", "밀양", "울산", "울산신복", "진주개양", "진주혁신", "진해", "창원역", "통영"];
  var daegu = ["김천혁신", "낙동강(휴)상행", "낙동강(휴)하행", "대구용계", "대구혁신", "상주", "선산(휴)상행", "선산(휴)하행", "서대구", 
  "안동", "영덕", "영주", "영천", "영천망정", "예천", "점촌", "포항", "포항시청", "풍기"];
  var target = document.getElementById("addressKindD");

  if(e.value == "a") var d = seoul;
  else if(e.value == "b") var d = incheon;
  else if(e.value == "c") var d = gangwon;
  else if(e.value == "d") var d = daejeon;
  else if(e.value == "e") var d = chungbug;
  else if(e.value == "f") var d = gwangju;
  else if(e.value == "g") var d = jeonbuk;
  else if(e.value == "h") var d = busan;
  else if(e.value == "i") var d = daegu;

  target.options.length = 0;

  for (x in d) {
      var opt = document.createElement("option");
      opt.value = d[x];
      opt.innerHTML = d[x];
      target.appendChild(opt);
  }   
}


function addressKindChange2(e) {
  var seoul = ["서울경부", "센트럴시티", "동서울", "상봉"];
  var incheon = ["인천", "성남", "수원", "인천공항T1", "인천공항T2", "안산", "안성중대", "이천", "용인", "고양백석", "고양화정", "광명(KTX역)", 
  "광명(철산역)", "구리", "부천", "서수원", "신갈시외", "신갈영덕", "시흥(시화)", "안성", "안성공도", "안성대림", "안성풍림", "안성한경", 
  "안성회관", "안중", "안중오거리", "여주", "여주대", "오산", "용인기흥역", "용인신갈", "용인유림", "의정부", "이천(마장택지구)", "이천부발(신하리)", 
  "죽전", "평택", "평택대", "평택용이"];
  var gangwon = ["원주고속", "속초고속", "강릉고속", "동해", "삼척", "양양", "원주기업", "원주문막", "원주혁신", "춘천", "횡성(휴)상행", "횡성(휴)하행"];
  var daejeon = ["대전복합", "천안고속", "서산", "유성고속", "세종청사", "당진", "공주", "대전청사(샘머리)", "세종터미널", "고대조치원", 
  "금산", "내포", "논산", "당진기지시", "대전도룡", "덕산스파", "배방정류소", "선문대", "세종국무조정실", "세종시청", "세종연구단지", "안면도", 
  "아산둔포", "아산서부(호서대)", "아산온양", "아산탕정사무소", "아산테크노밸리", "연무대", "예산", "인삼랜드(휴)상행", "인삼랜드(휴)하행", "정산", 
  "정안(휴)상행", "정안(휴)하행", "조치원", "창기리", "천안공단", "천안아산역", "청양", "탕정삼성", "태안", "홍대조치원", "홍성"];
  var chungbug = ["청주(센트럴)", "충주", "청주고속터미널", "북청주(청주대)", "교통대", "서충주", "제천", "제천하소", "청주공항", 
  "청주북부터미널", "황간"];
  var gwangju = ["광주(유스퀘어)", "순천", "목포", "여수", "강진", "고흥", "광양", "광주비아", "구례", "남악", "나주", "나주혁신도시", 
  "녹동", "능주", "담양", "동광양", "문장", "무안", "벌교", "보성", "섬진강(휴)상행", "섬진강(휴)하행", "순천신대지구", "순천신대지구CGV", "영광", 
  "영산포", "영암", "여천", "옥과", "완도", "원동", "임자대광", "임자진리", "장성", "고흥", "진도", "지도", "함평", "해남", "해제", "화순"];
  var jeonbuk = ["덕과", "순창", "애통리", "익산", "익산팔봉", "자치인재원", "전북혁신", "전주호남제일문", "정읍", "태인", "흥덕"];
  var busan = ["김해장유", "내서", "마산고속", "밀양", "울산", "울산신복", "진주개양", "진주혁신", "진해", "창원역", "통영"];
  var daegu = ["김천혁신", "낙동강(휴)상행", "낙동강(휴)하행", "대구용계", "대구혁신", "상주", "선산(휴)상행", "선산(휴)하행", "서대구", 
  "안동", "영덕", "영주", "영천", "영천망정", "예천", "점촌", "포항", "포항시청", "풍기"];
  var target = document.getElementById("addressKindD2");

  if(e.value == "a") var d = seoul;
  else if(e.value == "b") var d = incheon;
  else if(e.value == "c") var d = gangwon;
  else if(e.value == "d") var d = daejeon;
  else if(e.value == "e") var d = chungbug;
  else if(e.value == "f") var d = gwangju;
  else if(e.value == "g") var d = jeonbuk;
  else if(e.value == "h") var d = busan;
  else if(e.value == "i") var d = daegu;

  target.options.length = 0;

  for (x in d) {
      var opt = document.createElement("option");
      opt.value = d[x];
      opt.innerHTML = d[x];
      target.appendChild(opt);
  }   
}

function addressKindChange3(e) {
  var seoul = ["서울경부", "센트럴시티", "동서울", "상봉"];
  var incheon = ["인천", "성남", "수원", "인천공항T1", "인천공항T2", "안산", "안성중대", "이천", "용인", "고양백석", "고양화정", "광명(KTX역)", 
  "광명(철산역)", "구리", "부천", "서수원", "신갈시외", "신갈영덕", "시흥(시화)", "안성", "안성공도", "안성대림", "안성풍림", "안성한경", 
  "안성회관", "안중", "안중오거리", "여주", "여주대", "오산", "용인기흥역", "용인신갈", "용인유림", "의정부", "이천(마장택지구)", "이천부발(신하리)", 
  "죽전", "평택", "평택대", "평택용이"];
  var gangwon = ["원주고속", "속초고속", "강릉고속", "동해", "삼척", "양양", "원주기업", "원주문막", "원주혁신", "춘천", "횡성(휴)상행", "횡성(휴)하행"];
  var daejeon = ["대전복합", "천안고속", "서산", "유성고속", "세종청사", "당진", "공주", "대전청사(샘머리)", "세종터미널", "고대조치원", 
  "금산", "내포", "논산", "당진기지시", "대전도룡", "덕산스파", "배방정류소", "선문대", "세종국무조정실", "세종시청", "세종연구단지", "안면도", 
  "아산둔포", "아산서부(호서대)", "아산온양", "아산탕정사무소", "아산테크노밸리", "연무대", "예산", "인삼랜드(휴)상행", "인삼랜드(휴)하행", "정산", 
  "정안(휴)상행", "정안(휴)하행", "조치원", "창기리", "천안공단", "천안아산역", "청양", "탕정삼성", "태안", "홍대조치원", "홍성"];
  var chungbug = ["청주(센트럴)", "충주", "청주고속터미널", "북청주(청주대)", "교통대", "서충주", "제천", "제천하소", "청주공항", 
  "청주북부터미널", "황간"];
  var gwangju = ["광주(유스퀘어)", "순천", "목포", "여수", "강진", "고흥", "광양", "광주비아", "구례", "남악", "나주", "나주혁신도시", 
  "녹동", "능주", "담양", "동광양", "문장", "무안", "벌교", "보성", "섬진강(휴)상행", "섬진강(휴)하행", "순천신대지구", "순천신대지구CGV", "영광", 
  "영산포", "영암", "여천", "옥과", "완도", "원동", "임자대광", "임자진리", "장성", "고흥", "진도", "지도", "함평", "해남", "해제", "화순"];
  var jeonbuk = ["덕과", "순창", "애통리", "익산", "익산팔봉", "자치인재원", "전북혁신", "전주호남제일문", "정읍", "태인", "흥덕"];
  var busan = ["김해장유", "내서", "마산고속", "밀양", "울산", "울산신복", "진주개양", "진주혁신", "진해", "창원역", "통영"];
  var daegu = ["김천혁신", "낙동강(휴)상행", "낙동강(휴)하행", "대구용계", "대구혁신", "상주", "선산(휴)상행", "선산(휴)하행", "서대구", 
  "안동", "영덕", "영주", "영천", "영천망정", "예천", "점촌", "포항", "포항시청", "풍기"];
  var target = document.getElementById("addressKindD3");

  if(e.value == "a") var d = seoul;
  else if(e.value == "b") var d = incheon;
  else if(e.value == "c") var d = gangwon;
  else if(e.value == "d") var d = daejeon;
  else if(e.value == "e") var d = chungbug;
  else if(e.value == "f") var d = gwangju;
  else if(e.value == "g") var d = jeonbuk;
  else if(e.value == "h") var d = busan;
  else if(e.value == "i") var d = daegu;

  target.options.length = 0;

  for (x in d) {
      var opt = document.createElement("option");
      opt.value = d[x];
      opt.innerHTML = d[x];
      target.appendChild(opt);
  }   
}

function addressKindChange4(e) {
  var seoul = ["서울경부", "센트럴시티", "동서울", "상봉"];
  var incheon = ["인천", "성남", "수원", "인천공항T1", "인천공항T2", "안산", "안성중대", "이천", "용인", "고양백석", "고양화정", "광명(KTX역)", 
  "광명(철산역)", "구리", "부천", "서수원", "신갈시외", "신갈영덕", "시흥(시화)", "안성", "안성공도", "안성대림", "안성풍림", "안성한경", 
  "안성회관", "안중", "안중오거리", "여주", "여주대", "오산", "용인기흥역", "용인신갈", "용인유림", "의정부", "이천(마장택지구)", "이천부발(신하리)", 
  "죽전", "평택", "평택대", "평택용이"];
  var gangwon = ["원주고속", "속초고속", "강릉고속", "동해", "삼척", "양양", "원주기업", "원주문막", "원주혁신", "춘천", "횡성(휴)상행", "횡성(휴)하행"];
  var daejeon = ["대전복합", "천안고속", "서산", "유성고속", "세종청사", "당진", "공주", "대전청사(샘머리)", "세종터미널", "고대조치원", 
  "금산", "내포", "논산", "당진기지시", "대전도룡", "덕산스파", "배방정류소", "선문대", "세종국무조정실", "세종시청", "세종연구단지", "안면도", 
  "아산둔포", "아산서부(호서대)", "아산온양", "아산탕정사무소", "아산테크노밸리", "연무대", "예산", "인삼랜드(휴)상행", "인삼랜드(휴)하행", "정산", 
  "정안(휴)상행", "정안(휴)하행", "조치원", "창기리", "천안공단", "천안아산역", "청양", "탕정삼성", "태안", "홍대조치원", "홍성"];
  var chungbug = ["청주(센트럴)", "충주", "청주고속터미널", "북청주(청주대)", "교통대", "서충주", "제천", "제천하소", "청주공항", 
  "청주북부터미널", "황간"];
  var gwangju = ["광주(유스퀘어)", "순천", "목포", "여수", "강진", "고흥", "광양", "광주비아", "구례", "남악", "나주", "나주혁신도시", 
  "녹동", "능주", "담양", "동광양", "문장", "무안", "벌교", "보성", "섬진강(휴)상행", "섬진강(휴)하행", "순천신대지구", "순천신대지구CGV", "영광", 
  "영산포", "영암", "여천", "옥과", "완도", "원동", "임자대광", "임자진리", "장성", "고흥", "진도", "지도", "함평", "해남", "해제", "화순"];
  var jeonbuk = ["덕과", "순창", "애통리", "익산", "익산팔봉", "자치인재원", "전북혁신", "전주호남제일문", "정읍", "태인", "흥덕"];
  var busan = ["김해장유", "내서", "마산고속", "밀양", "울산", "울산신복", "진주개양", "진주혁신", "진해", "창원역", "통영"];
  var daegu = ["김천혁신", "낙동강(휴)상행", "낙동강(휴)하행", "대구용계", "대구혁신", "상주", "선산(휴)상행", "선산(휴)하행", "서대구", 
  "안동", "영덕", "영주", "영천", "영천망정", "예천", "점촌", "포항", "포항시청", "풍기"];
  var target = document.getElementById("addressKindD4");

  if(e.value == "a") var d = seoul;
  else if(e.value == "b") var d = incheon;
  else if(e.value == "c") var d = gangwon;
  else if(e.value == "d") var d = daejeon;
  else if(e.value == "e") var d = chungbug;
  else if(e.value == "f") var d = gwangju;
  else if(e.value == "g") var d = jeonbuk;
  else if(e.value == "h") var d = busan;
  else if(e.value == "i") var d = daegu;

  target.options.length = 0;

  for (x in d) {
      var opt = document.createElement("option");
      opt.value = d[x];
      opt.innerHTML = d[x];
      target.appendChild(opt);
  }   
}
